app/views/users/show.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."renter_id" = $1 AND "reservations"."confirmed" = $2  [["renter_id", 2], ["confirmed", true]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."renter_id" = $1 AND "reservations"."confirmed" = $2  [["renter_id", 4], ["confirmed", true]]
---

<% if @user.confirmed_renter_reservations.count == 0 && @user.pending_renter_reservations.count == 0 %>