app/views/venues/index.html.erb

    <div id="venue_results">
    <%= link_to image_tag(venue.images.first.image.url(:thumb)), venue_path(venue) %><br>
---
SELECT  "images".* FROM "images" WHERE "images"."venue_id" = $1 ORDER BY "images"."id" ASC LIMIT $2  [["venue_id", 1], ["LIMIT", 1]]

    <%= venue.city %>, <%= venue.zip_code %><br>
    <% venue.listings.each do |listing| %>
---
SELECT "listings".* FROM "listings" WHERE "listings"."venue_id" = $1  [["venue_id", 1]]