app/views/venues/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."venue_id" = $1  [["venue_id", 3]]
---
  <ul>
  <% @venue.images.each do |image| %>

SELECT "listings".* FROM "listings" WHERE (venue_id = '6' AND available_start_date <= '2016-09-10' AND available_end_date >= '2016-09-10')
---

<% @venue.listings.each do |listing| %>