app/views/venues/show.json.jbuilder


@venue.listings.each do |listing|
---
SELECT "listings".* FROM "listings" WHERE "listings"."venue_id" = $1  [["venue_id", 5]]