app/views/reservations/index.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."renter_id" = $1 AND "reservations"."confirmed" = $2  [["renter_id", 4], ["confirmed", true]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."renter_id" = $1 AND "reservations"."confirmed" = $2  [["renter_id", 4], ["confirmed", true]]
---

  <% if @user.confirmed_renter_reservations.count == 0 && @user.pending_renter_reservations.count == 0 %>

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "venues".* FROM "venues" INNER JOIN "listings" ON "venues"."id" = "listings"."venue_id" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <strong>Venue: </strong><%= link_to res.listing.venue.name, reservation_path(res) %> <br>
      <strong>Host: <strong><%= "#{res.listing.venue.host.first_name} #{res.listing.venue.host.last_name}" %></strong> <br>