app/views/reservations/show.html.erb

SELECT  "venues".* FROM "venues" INNER JOIN "listings" ON "venues"."id" = "listings"."venue_id" WHERE "listings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<h1> Hello, <%= @reservation.renter.first_name %>. Your reservation at <%= @reservation.venue.name %> is pending. A representative will be in touch shortly. </h1>