app/controllers/listings_controller.rb

  def show
    @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE (venue_id = '6' AND available_start_date <= '2016-09-10' AND available_end_date >= '2016-09-10')

  def create
    listing = Listing.new(listing_params)
    if listing.save
      redirect_to venue_path(listing_params[:venue_id])
    else
      redirect_to venue_path(listing_params[:venue_id]), notice: listing.errors.full_messages.join(". ")
---
INSERT INTO "listings" ("venue_id", "available_start_date", "available_end_date", "available_start_time", "available_end_time", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "listings".* FROM "listings" WHERE "listings"."venue_id" = $1  [["venue_id", 4]]

  def edit #delete
    @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update #delete
    @listing = Listing.find(params[:id])
    @listing.update(listing_params)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "listings" SET "available_start_date" = $1, "available_start_time" = $2, "available_end_time" = $3, "updated_at" = $4 WHERE "listings"."id" = $5  [["available_start_date", Mon, 05 Sep 2016], ["available_start_time", 2000-01-01 20:00:00 UTC], ["available_end_time", 2000-01-01 20:00:00 UTC], ["updated_at", 2016-09-09 05:07:09 UTC], ["id", 1]]

  def destroy
    listing = Listing.find(params[:id])
    # venue_id = @listing.venue_id
    listing.reservations.destroy_all
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]