app/controllers/registrations_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$VGDiZOiUF0vOpDwQK7wBdeKASr4tcG2r6QIAq/to13R99WXkPcrs."], ["created_at", 2016-09-09 17:52:49 UTC], ["updated_at", 2016-09-09 17:52:49 UTC]]