app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT  "reservations".* FROM "reservations" ORDER BY "reservations"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    reservation = Reservation.new(reservation_params) #makes a new reservation (not yet saved! with the reqested dates )
    venue_id = params[:reservation][:venue_id]
    listing = Listing.all.where("venue_id = ? AND available_start_date <= ? AND available_end_date >= ?", venue_id, reservation.start_date, reservation.end_date) #looks up any listings
    if listing != []
      reservation.renter_id= current_user.id
      reservation.listing = listing.first
        if reservation.save
          redirect_to reservation_path(reservation), notice: "Your reservation was sucessfully created."
        else
          @venue = Venue.find(venue_id)
---
SELECT  "listings".* FROM "listings" WHERE (venue_id = '6' AND available_start_date <= '2016-09-16' AND available_end_date >= '2016-09-18') ORDER BY "listings"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = $1 AND "reservations"."confirmed?" = $2  [["listing_id", 2], ["confirmed?", true]]
INSERT INTO "reservations" ("listing_id", "renter_id", "start_date", "end_date", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    @reservation.update(reservation_params)
---
UPDATE "reservations" SET "end_date" = $1, "start_time" = $2, "end_time" = $3, "updated_at" = $4 WHERE "reservations"."id" = $5  [["end_date", Tue, 13 Sep 2016], ["start_time", 2000-01-01 20:00:00 UTC], ["end_time", 2000-01-01 20:00:00 UTC], ["updated_at", 2016-09-09 04:32:45 UTC], ["id", 2]]

  def destroy
    @reservation.destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 7]]

  def set_reservation
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]