app/controllers/reservations_controller.rb

  def create
    # reservation_creator = ReservationCreator.new(params)
    # reservation_creator.create_reservation
    # if reservation_creator.valid?
    #   redirect_to reservation_path(reservation_creator.reservation)
    # else
    #   redirect_to venue_path(Venue.find(venue_id)), notice: reservation_creator.notice )
    # end

    #listing.find_by instead of .where to return just one object

    #makes a new reservation (not yet saved! with the reqested dates)
    reservation = Reservation.new(reservation_params)
    # set venue_id with params
    venue_id = params[:reservation][:venue_id]
    #use venue_id to run ActiveRecord query to locate the one listing (if it exists) that encompasses the desired reservation date rage
    listing = Listing.where("venue_id = ? AND available_start_date <= ? AND available_end_date >= ?", venue_id, reservation.start_date, reservation.end_date) #looks up any listings
    # if there exists a listing, set renter_id to current_user and associate reservation listing
    if listing != []
      reservation.renter_id = current_user.id
      reservation.listing = listing[0]
        # run save to run reservation validations
        if reservation.save
          ReservationRequestMailer.reservation_request_email(reservation.host).deliver
          redirect_to reservation_path(reservation)
        else
          # redirect to venue show page if cannot save
          # binding.pry
          redirect_to venue_path(Venue.find(venue_id)), notice: reservation.errors.full_messages.join(". ")
---
SELECT  "venues".* FROM "venues" INNER JOIN "listings" ON "venues"."id" = "listings"."venue_id" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]