app/controllers/venues_controller.rb

  def create
    @venue = Venue.create(venue_params)
    # @venue.host_id=(current_user.id)
    # @venue.save
    if @venue.errors.any?
---
INSERT INTO "venues" ("host_id", "name", "address", "description", "created_at", "updated_at", "city", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "venues".* FROM "venues" ORDER BY "venues"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def index

    # if the request is coming from a 'search' page, set params equal to respective attributes
    if params[:commit] == "Search"
      @zip_code = params[:zip_code]
      @start_date = params[:start_date]
      @end_date = params[:end_date]
      flash[:notice] = ""
      # if search submission attributes are nil, return error and load all venues
      if @zip_code == nil || @start_date == nil || @end_date == nil
        flash[:notice] << "Search fields cannot be blank"
        @venues = Venue.all
      # else if search dates sensible, return error and load all venues
      elsif @start_date > @end_date
        flash[:notice] << "Start date cannot be before end date"
        @venues = Venue.all
      # else run the Active Record query
      else
        @venues = Venue.joins(:listings).where("available_start_date <= ? AND available_end_date >= ? AND price >= ? AND price <= ?", params[:start_date], params[:end_date], params[:price_min_input], params[:price_max_input])
      end
    # if the request is not coming from the search page, load all venues
    else
      @venues = Venue.all
---
SELECT "venues".* FROM "venues"
SELECT "venues".* FROM "venues" INNER JOIN "listings" ON "listings"."venue_id" = "venues"."id" WHERE (available_start_date <= '2016-10-01' AND available_end_date >= '2016-10-12' AND price >= '85' AND price <= '283')
SELECT "listings".* FROM "listings" WHERE "listings"."venue_id" = $1  [["venue_id", 1]]

  def update
    @venue.update(venue_params)
---
UPDATE "venues" SET "zip_code" = $1, "city" = $2, "updated_at" = $3 WHERE "venues"."id" = $4  [["zip_code", "10002"], ["city", "New York"], ["updated_at", 2016-09-11 19:26:05 UTC], ["id", 1]]

  def destroy
    @venue.listings.each do |lis|
      lis.reservations.each do |res|
        res.destroy
      end
      lis.destroy
    end
    @venue.destroy
---
DELETE FROM "venues" WHERE "venues"."id" = $1  [["id", 3]]

 def set_venue
   @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]