app/controllers/venues_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."venue_id" = $1  [["venue_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = $1  [["listing_id", 5]]
---
  def show
    listings = @venue.listings
    hash = {}
    listings.each do |listing|
      listing.reservations.each do |res|